# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Dual-Stream Polarity Fusion
# 使用极性感知双流融合模块，挖掘ODG图像中红绿通道的物理含义
# 
# 创新点：
# 1. 将输入通道分离为红光通道（正极性）和绿光通道（负极性）两个独立分支
# 2. 设计Polarity Interaction Module计算正负极性之间的空间关联
# 3. 特征融合后送入YOLO Neck
#
# 适用性：这种从"极性对称性"入手的方法，具有极强的学术深度，非常适合发高水平论文

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Dual-Stream Polarity Fusion
# 策略：在第一层使用极性融合模块，将RGB图像分离为正负极性分支
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, k, s, p, g, d, act]
  # 注意：输入通道c1自动从上一层获取，这里只需要指定输出通道c2
  - [-1, 1, DualStreamPolarityFusion, [64, 3, 2, None, 1, 1, True]] # 0-P1/2 (极性融合: 3->64, H/2, W/2)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (标准下采样)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26s head (保持不变)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
