# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Haar Wavelet Downsampling
# 使用Haar小波下采样替换标准stride=2卷积，保留高频边缘信息
# 适用于ES-ImageNet等稀疏边缘图像数据集
#
# 注意：HaarDownsample输出通道数是输入的4倍
# 例如：64 -> 256, 128 -> 512, 256 -> 1024

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Haar Downsampling
# 策略：只在P2/4层使用Haar下采样，其他层保持标准卷积
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (第一层使用标准卷积)
  - [-1, 1, HaarDownsample, [64, 256]] # 1-P2/4 (Haar下采样: 64->256通道，H/2, W/2)
  - [-1, 1, Conv, [128, 1, 1]] # 2-降维: 256->128通道 (避免通道数爆炸)
  - [-1, 2, C3k2, [256, False, 0.25]] # 3 (输入128，输出256)
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8 (标准下采样)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

# YOLO26s head (保持不变)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
