# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Global-Local Frequency YOLO
# 频域与空域双路径学习，通过FFT/IFFT在频域进行全局滤波
# 
# 创新点：
# 1. 将特征图转换到频域，进行全局滤波
# 2. 通过IFFT转回空域，与空域特征融合
# 3. 弥补局部卷积无法连接断裂边缘的缺陷
#
# Reference: Rao, Y., et al. "Global Filter Networks for Image Classification." (NeurIPS 2021)

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Frequency Domain Learning
# 策略：在关键层引入频域块，实现频域与空域双路径学习
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, use_complex] (use_complex=True使用复数权重)
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, FFTBlock, [256, True]] # 4-频域块（增强边缘连续性）
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 1, FFTBlock, [512, True]] # 7-频域块
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO26s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
