# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Structural Connectivity Module
# 结构连通性感知模块，用于事件图像的轮廓形成
#
# 核心思想：
# 在模拟事件图像中，单个点没有语义意义。对象身份来自于高响应事件点的连通性和连续性。
# 因此，网络应该首先学习点是否属于同一结构轮廓，然后再进行边界框回归。
#
# 架构特点：
# 1. 节点构建：将高激活空间位置提取为图节点（包含局部特征向量和归一化空间坐标）
# 2. 局部图构建：使用KNN或半径邻域构建图（非学习的）
# 3. 连通性感知消息传递：轻量级GNN学习节点是否属于同一结构轮廓
# 4. 结构特征重投影：将增强的节点特征重新投影回原始特征图分辨率
# 5. 残差融合：与原始卷积特征融合
#
# Reference: Event-based vision, Graph Neural Networks for object detection

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Connectivity-Aware Module
# 策略：在backbone中间阶段（C3k2之后）插入连通性感知模块
# 使网络能够从稀疏事件点形成连贯的对象形状结构
backbone:
  # [from, repeats, module, args]
  # ConnectivityAwareBlock args格式: [c2, k, s, num_nodes, k_neighbors, message_passing_layers]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ConnectivityAwareBlock, [256, 3, 1, 128, 8, 2]] # 3-连通性感知模块（在P3之前）
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ConnectivityAwareBlock, [512, 3, 1, 128, 8, 2]] # 6-连通性感知模块（在P4之前）
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, ConnectivityAwareBlock, [512, 3, 1, 128, 8, 2]] # 9-连通性感知模块
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

# YOLO26s head (标准结构)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 21 (P5/32-large)

  - [[17, 19, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
