# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Graph-Augmented YOLO
# 基于图表示的几何推理，将边缘点视为图节点进行几何关系推理
# 
# 创新点：
# 1. 将稀疏边缘点提取为图节点
# 2. 利用图卷积进行信息交换
# 3. 将GCN提取的几何结构特征与CNN纹理特征融合
#
# Reference: Li, G., et al. "DeepGCNs: Can GCNs Go as Deep as CNNs?" (ICCV 2019)

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Graph Reasoning
# 策略：在关键层引入图推理模块，捕捉边缘点之间的几何拓扑关系
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, k, s, p, g, d, act, num_nodes]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, GCNBlock, [512, 3, 1, None, 1, 1, True, 64]] # 5-图推理（64个节点）
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, GCNBlock, [512, 3, 1, None, 1, 1, True, 64]] # 8-图推理
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO26s head with Graph Reasoning
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15
  - [-1, 1, GCNBlock, [512, 3, 1, None, 1, 1, True, 64]] # 16-图推理

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 19 (P3/8-small)
  - [-1, 1, GCNBlock, [256, 3, 1, None, 1, 1, True, 64]] # 20-图推理

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32-large)

  - [[19, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
