# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Dynamic Snake Convolution (DSConv)
# 使用动态蛇形卷积增强对线条化、弯曲边缘的检测能力
# 适用于ODG图像、长条形目标检测等场景
#
# Reference: Qi, Y., et al. "Dynamic Snake Convolution based on Topological 
# Geometric Constraints for Tubular Structure Segmentation." ICCV 2023

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Dynamic Snake Convolution
# 策略：在瓶颈层使用DSConv替换标准卷积，增强对曲线边缘的感知
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, k, s, p, g, d, act, deform_groups]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  # 在C3k2中使用DSConv增强特征提取
  - [-1, 1, DSConv, [512, 3, 1, None, 1, 1, True, 1]] # 5-增强特征
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, DSConv, [512, 3, 1, None, 1, 1, True, 1]] # 8-增强特征
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO26s head with DSConv enhancement
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15
  - [-1, 1, DSConv, [512, 3, 1, None, 1, 1, True, 1]] # 16-增强特征

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 19 (P3/8-small)
  - [-1, 1, DSConv, [256, 3, 1, None, 1, 1, True, 1]] # 20-增强特征

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32-large)

  - [[19, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
