# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Vision Mamba (VMamba / C2f-VSS)
# 使用C2fVSS替换C2f，通过SS2D选择性扫描机制实现全局感受野
# 解决ODG图像中鱼体轮廓断裂连通问题
#
# Reference: Liu, Y., et al. "VMamba: Visual State Space Model." arXiv 2024 / CVPR 2024

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with C2fVSS
# 策略：在关键层使用C2fVSS替换C3k2，实现全局感受野
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, n, shortcut, g, e, d_state, d_conv]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fVSS, [256, 2, False, 1, 0.25, 16, 3]] # 2 (使用C2fVSS: n=2, d_state=16, d_conv=3)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fVSS, [512, 2, False, 1, 0.25, 16, 3]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2fVSS, [512, 2, True, 1, 0.5, 16, 3]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2fVSS, [1024, 2, True, 1, 0.5, 16, 3]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26s head (使用C2fVSS增强)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2fVSS, [512, 2, True, 1, 0.5, 16, 3]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2fVSS, [256, 2, True, 1, 0.5, 16, 3]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2fVSS, [512, 2, True, 1, 0.5, 16, 3]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fVSS, [1024, 1, True, 1, 0.5, 16, 3]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
