# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with SPD-Conv (Space-to-Depth Convolution)
# 使用SPD-Conv替换标准stride=2卷积，彻底解决"点信息丢失"问题
# 适用于ODG图像、小目标检测等场景
#
# Reference: Sunkara, R., et al. "No More Strided Convolutions or Pooling: 
# A New CNN Building Block for Low-Resolution Images and Small Objects." WACV 2022/2023

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with SPD-Conv
# 策略：在前几层使用SPD-Conv替换stride=2的卷积，保留所有空间信息
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, k, s, p, g, d, act, scale_factor]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (第一层保持标准卷积)
  - [-1, 1, SPDConv, [128, 3, 2, None, 1, 1, True, 2]] # 1-P2/4 (SPD-Conv: 64->128, H/2, W/2)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, SPDConv, [256, 3, 2, None, 1, 1, True, 2]] # 3-P3/8 (SPD-Conv: 256->256, H/2, W/2)
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 (标准下采样)
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26s head (保持不变)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  # SEAM模块：只在Detect之前添加，增强上下文信息提取
  # 对P3, P4, P5三个尺度的特征分别应用SEAM
  # SEAM args格式: [c2, kernel_sizes, reduction, act]
  - [16, 1, SEAM, [256, [3, 5, 7], 4, True]] # 23-SEAM增强P3特征
  - [19, 1, SEAM, [512, [3, 5, 7], 4, True]] # 24-SEAM增强P4特征
  - [22, 1, SEAM, [1024, [3, 5, 7], 4, True]] # 25-SEAM增强P5特征

  - [[23, 24, 25], 1, Detect, [nc]] # Detect(P3, P4, P5 with SEAM)
