# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# Ultralytics YOLO26s with Lateral Inhibition Module
# 仿生"侧向抑制"机制，锐化边缘、消除背景干扰
# 
# 创新点：
# 1. 借鉴生物视觉系统的侧向抑制原理
# 2. 增强强边缘点，抑制孤立的弱噪声点
# 3. 通过竞争机制让特征图变得干净，只剩下物体的拓扑骨架
#
# Reference: Wang, L., et al. "Biologically Inspired Lateral Inhibition Network for Edge Detection."

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs

# YOLO26s backbone with Lateral Inhibition
# 策略：在瓶颈层使用侧向抑制模块，锐化边缘特征
backbone:
  # [from, repeats, module, args]
  # args格式: [c2, k, s, p, g, d, act]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, LIM, [512, 3, 1, None, 1, 1, True]] # 5-侧向抑制（锐化边缘）
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  - [-1, 1, LIM, [512, 3, 1, None, 1, 1, True]] # 8-侧向抑制
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO26s head with Lateral Inhibition
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15
  - [-1, 1, LIM, [512, 3, 1, None, 1, 1, True]] # 16-侧向抑制

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 19 (P3/8-small)
  - [-1, 1, LIM, [256, 3, 1, None, 1, 1, True]] # 20-侧向抑制

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32-large)

  - [[19, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
