# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11n with BiFormer Neck
# 使用 BiFormer 的 Bi-Level Routing Attention 替换标准 neck

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs

# YOLO11n backbone (保持不变)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with BiFormer-T Neck (最小参数配置)
# BiFormer-T 配置: head_dim=32, topks=[1,4,16,-2], mlp_ratio=3, n_win=7
head:
  # 上采样路径 (P5 -> P4 -> P3)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, BiFormerNeck, [512, 16, 7, 4, 3]] # 13 - BiFormer-T Neck (c2, num_heads, n_win, topk, mlp_ratio)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, BiFormerNeck, [256, 8, 7, 1, 3]] # 16 (P3/8-small) - BiFormer-T Neck

  # 下采样路径 (P3 -> P4 -> P5)
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 1, BiFormerNeck, [512, 16, 7, 4, 3]] # 19 (P4/16-medium) - BiFormer-T Neck

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, BiFormerNeck, [1024, 32, 7, 4, 3]] # 22 (P5/32-large) - BiFormer-T Neck

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
